{
  "cache": [
    [
      "highlights:The End of Jobs: Money, Meaning and Freedom Without the 9-to-5",
      {
        "value": "{\"value\":[{\"highlights\":[\"What if the better question is: “How do I create a job doing that?”\",\"The number of individuals looking for jobs, hoping to follow someone else’s orders, are growing exponentially.\",\"It’s the work of understanding and operating in the complex and chaotic systems—entrepreneurship—that’s increasingly in demand.\",\"If you’re trying to grow a business, there’s always a primary limit preventing that. If you have an amazing product and no one knows about it, improving the product won’t help it sell more.\",\"“If I had an hour to solve a problem, I would spend 59 minutes asking the right questions,”\",\"Limits can be applied to any system in order to dramatically improve the outcome without having to dramatically improve the inputs.\",\"We aren’t going through a global recession—we’re transitioning between two distinct economic periods.\",\"knowledge, they’re going back to school to get more credentials. Even as the returns on credentials are declining, still students continue to pay more and more for them.\",\"we frequently avoid making choices not because the outcome is bad, but simply because it’s unknown.\",\"We assume jobs are safe because they’ve always been safe, not because there’s good evidence they will be in the future.\",\"The longer the market goes without having a correction, the larger the correction will be when it happens. The longer we go in our careers and businesses without variation or randomness, the larger the amount of underlying risk we accumulate.\",\"provide in terms of marketing. What\",\"Because technology develops faster than biological systems (like our brains), we’re not very good at understanding these kinds of changes, but they happen all the time in the modern world.\",\"In a world without the internet, where information was expensive and the only way to learn was to get a degree, that made sense. In a world with the internet, where information is rapidly approaching free, it’s hard to rationalize spending money paying for access to general knowledge when you can get the same knowledge for free.\",\"launching a product that sells for a one-time fee\",\"you can start to expand your toolbelt of relationships and skills.\",\"Instead of working nights and weekends like you had been, you’ve got 40–60 hours a week to put in on your business, giving you a platform to launch bigger products, and projects from.\",\"Experienced entrepreneurs frequently deal with “shiny object syndrome,” a phenomenon where they see too many opportunities and have too many ideas, and not enough resources to pursue them.\",\"More wealth leads to larger families, which needed to be fed. A cycle of increasing family size and community requiring more material wealth began.\",\"The Greeks also saw work as a curse. The Greek god of hard labor was Ponos, taken from the Latin poena for sorrow. Manual labor was for slaves, and hard work was looked down upon.\",\"Plato and Aristotle believed work was for the majority so that the elite might “engage in pure exercises of the mind—art, philosophy, and politics.”\",\"an increase in sheer quantity of hours failed to generate more wealth creation or greater productivity.\",\"Because it led to a better overall quality of life, we’ve accepted work as a disutility because it was necessary to survive as a society and a worthy trade-off for us as individuals.\",\"Money is really just a proxy for general material wealth, but it’s a pretty accurate proxy and medium of exchange.\",\"If we can structure meaning and freedom into our work now, we see the Tom Sawyer Effect—work goes from being an obligation to a choice.\",\"As the Industrial Revolution proved, we can make more money and more wealth. We still haven’t invented the ability to make more time.\",\"Jobs not only limit the upside of intrinsic value by tying money to time—they also give up control. We have no leverage beyond trading more time, which is our most valuable and only truly limited asset. We lose control to react to market forces outside the scope of the job.\",\"It’s cheaper, easier, and safer to start a business. When you grow it using variables you control, you make more money because you have unlimited leverage.\",\"“There is only one success—to be able to spend your life in your own way.”\",\"I believed in “building businesses to create more freedom and wealth in your life and the lives of those you love.”\"],\"synced\":1601308167302},{\"highlights\":[\"The Baby Boomer generation built the knowledge economy, which gave them more free time and the discretionary income to enjoy it than their parents’ generation ever imagined.\"],\"synced\":1601309376295},{\"highlights\":[],\"synced\":1601311089604},{\"highlights\":[\"The entrepreneur defines reality, he is not defined by it. He is engaged in a dialogue with his reality asking “why” and “why not” instead of “how” or “what.”\"],\"synced\":1601716617288}],\"expires\":null}"
      }
    ],
    [
      "highlights:The Pragmatic Programmer: your journey to mastery, 20th Anniversary Edition",
      {
        "value": "{\"value\":[{\"highlights\":[\"There’s one technique that you must use if you want people to listen to you: listen to them.\",\"Unless you work in a vacuum, you need to be able to communicate. The more effective that communication, the more influential you become.\",\"A thing is well designed if it adapts to the people who use it. For code, that means it must adapt by changing. So we believe in the ETC principle: Easier to Change. ETC. That’s it.\",\"Our experience is that it requires some initial conscious reinforcement.\",\"You may need to spend a week or so deliberately asking yourself “did the thing I just did make the overall system easier or harder to change?” Do it when you save a file. Do it when you write a test. Do it when you fix a bug.\",\"DRY is about the duplication of knowledge, of intent. It’s about expressing the same thing in two different places, possibly in two totally different ways.\",\"when some single facet of the code has to change, do you find yourself making that change in multiple places, and in multiple different formats? Do you have to change code and documentation, or a database schema and a structure that holds it, or…? If so, your code isn’t DRY.\",\"The code is the same, but the knowledge they represent is different. The two functions validate two separate things that just happen to have the same rules. That’s a coincidence, not a duplication.\",\"We feel that the best way to deal with this is to encourage active and frequent communication between developers.\",\"And make a point of reading other people’s source code and documentation, either informally or during code reviews. You’re not snooping—you’re learning from them.\",\"if you fail to reuse, you risk duplicating knowledge.\",\"Two or more things are orthogonal if changes in one do not affect any of the others. In a well-designed system, the database code will be orthogonal to the user interface: you can change the interface without affecting the database, and swap databases without changing the interface.\"],\"synced\":1601311091061}],\"expires\":null}"
      }
    ],
    [
      "highlights:How to Take Smart Notes: One Simple Technique to Boost Writing, Learning and Thinking – for Students, Academics and Nonfiction Book Writers",
      {
        "value": "{\"value\":[{\"highlights\":[\"Every task that is interesting, meaningful and well-defined will be done,\",\"There is no point in having great tools if they don’t fit together.\",\"Studies on highly successful people have proven again and again that success is not the result of strong willpower and the ability to overcome resistance, but rather the result of smart working environments that avoid resistance in the first place\",\"Always have something at hand to write with to capture every idea that pops into your mind.\",\"Put them into one place, which you define as your inbox, and process them later.\",\"Make literature notes. Whenever you read something, make notes about the content.\",\"Make permanent notes. Now turn to your slip-box. Go through the notes you made in step one or two (ideally once a day and before you forget what you meant) and think about how they relate to what is relevant for your own research, thinking or interests.\",\"Write exactly one note for each idea and write as if you were writing for someone else: Use full sentences, disclose your sources, make references and try to be as precise, clear and brief as possible. Throw away the fleeting notes from step one and put the literature notes from step two into your reference system. You can forget about them now. All that matters is going into the slip-box.\",\"According to this story, the Russians faced the same problem. So they used pencils\",\"The slip-box follows the Russian model: Focus on the essentials, don’t complicate things unnecessarily.\",\"reduce distractions from the main work, which here is thinking.\",\"Tools are only as good as your ability to work with them.\",\"In the old system, the question is: Under which topic do I store this note? In the new system, the question is: In which context will I want to stumble upon it again?\",\"The slip-box is designed to present you with ideas you have already forgotten, allowing your brain to focus on thinking instead of remembering.\",\"mass. The collection of good ideas is diluted to insignificance by all the other notes, which are only relevant for a specific project or actually not that good on second sight.\",\"Even small amounts of unclear and unrelated notes lingering around your desk will soon induce the wish of starting from scratch.\",\"benefit of note-taking decreases with the number of notes you keep.\",\"Fleeting notes are only useful if you review them within a day or so and turn them into proper notes you can use later.\",\"To be able to decide on a topic, one must already have read quite a bit and certainly not just about one topic.\",\"If we look into our slip-box to see where clusters have built up, we not only see possible topics, but topics we have already worked on\",\"Nothing motivates us more than the experience of becoming better at what we do.\",\"fear of failure has the ugliest name of all phobias: Kakorrhaphiophobia.\",\"We tend to think we understand what we read – until we try to rewrite it in our own words.\",\"Psychologists used to think of the brain as a limited storage space that slowly fills up and makes it more difficult to learn late in life.\",\"When it comes to focused attention, we focus on one thing only, something we can sustain for only a few seconds.\",\"obvious how different the tasks are that are usually summarised under “writing” and how different the kinds of attention are that they require.\",\"different state of mind than the attempt to find the right words.\",\"it is not a relentless focus, but flexible focus that distinguishes them.\",\"The key to creativity is being able to switch between a wide-open, playful mind and a narrow analytical frame.”\",\"The moment we stop making plans is the moment we start to learn.\",\"But they are keeping you from learning the very thing academia and writing is all about: gaining insight and making it public.\",\"We can hold a maximum of seven things in our head at the same time, plus/minus two\",\"Things we understand are connected, either through rules, theories, narratives, pure logic, mental models or explanations.\",\"Zeigarnik effect: Open tasks tend to occupy our short-term memory – until they are done.\",\"The brain doesn't distinguish between an actual finished task and one that is postponed by taking a note.\",\"walk or a shower or clean the house, the brain cannot help but play around with the last unsolved problem it came across. And that is why we so often find the answer to a question in rather casual situations.\",\"willpower is compared to muscles: a limited resource that depletes quickly and needs time to recover.\",\"which is why people like Barack Obama or Bill Gates only wear two suit colours: dark blue or dark grey. This means they have one less decision to make in the morning, leaving more resources for the decisions that really matter.\",\"If we don’t give ourselves a break in between work sessions, be it out of eagerness or fear of forgetting what we were doing, it can have a detrimental effect on our efforts.\",\"idea is not to copy, but to have a meaningful dialogue with the texts we read.\",\"copying of quotes almost always changes their meaning by stripping them out of context, even though the words aren’t changed.\",\"Sometimes the only thing that is done is underlining sentences and making some comments in the margins of a book, which is almost like taking no notes at all.\",\"Developing arguments and ideas bottom-up instead of top-down is the first and most important step to opening ourselves up for insight.\",\"But with the learned ability of spotting patterns, we can enter the circle of virtuosity: Reading becomes easier, we grasp the gist quicker, can read more in less time, and can more easily spot patterns and improve our understanding of them.\",\"Probably the best method is to take notes – not excerpts, but condensed reformulated accounts of a text.\",\"Rewriting what was already written almost automatically trains one to shift the attention towards frames, patterns and categories in the observations, or the conditions/assumptions, which enable certain, but not other descriptions.\",\"The ability to spot patterns, to question the frames used and detect the distinctions made by others, is the precondition to thinking critically and looking behind the assertions of a text or a talk.\",\"If we don’t try to verify our understanding during our studies, we will happily enjoy the feeling of getting smarter and more knowledgeable while in reality staying as dumb as we were.\",\"while writing down an idea feels like a detour, extra time spent, not writing it down is the real waste of time, as it renders most of what we read as ineffectual.\",\"usually read a text with questions in mind and try to relate it to other possible approaches, while inexperienced readers tend to adopt the question of a text and the frames of the argument and take it as a given.\",\"Writing brief accounts on the main ideas of a text instead of collecting quotes.\",\"Taking permanent notes of our own thoughts is a form of self-testing as well: do they still make sense in writing?\",\"Only in the written form can an argument be looked at with a certain distance – literally. We need this distance to think about an argument – otherwise the argument itself would occupy the very mental resources we need for scrutinizing it.\",\"The brain, as Kahneman writes, is “a machine for jumping to conclusions”\",\"“They aren’t a record of my thinking process. They are my thinking process. I actually did the work on the paper.”\",\"By explicitly writing down how something connects or leads to something else, we force ourselves to clarify and distinguish ideas from each other.\",\"Transferring ideas into the external memory also allows us to forget them. And even though it sounds paradoxical, forgetting actually facilitates long-term learning.\",\"obvious that for academic thinking and writing, the gift of being able to remember everything is a serious liability.\"],\"synced\":1601311092792}],\"expires\":null}"
      }
    ],
    [
      "highlights:The 4-Hour Body: An Uncommon Guide to Rapid Fat-loss, Incredible Sex and Becoming Superhuman",
      {
        "value": "{\"value\":[{\"highlights\":[\"The Minimum\",\"Want to extend the fat-burning half-life of caffeine? Naringenin, a useful little molecule in grapefruit juice, does just the trick.\",\"Here’s the sad truth: most of the one-size-fits-all rules, this being one example, haven’t been field-tested for exceptions.\",\"I’ve recorded almost every workout I’ve done since age 18.\",\"Over-fat? Try timed protein and pre-meal lemon juice. Under-muscled? Try ginger and sauerkraut.\",\"“Fifty per cent of what we know is wrong. The problem is that we do not know which 50% it is.”\",\"The minimum effective dose (MED) is defined simply: the smallest dose that will produce a desired outcome.\",\"you don’t need to understand radiation to use a microwave oven.\",\"But isn’t weight loss or gain as simple as calories in and calories out?\",\"Think “all-natural” is safer than synthetic? Split peas are all-natural, but so is arsenic.\",\"The decent method you follow is better than the perfect method you quit.\",\"Exercise, on the other hand, means performing an MED of precise movements that will produce a target change.\",\"Many “new and improved” recommendations are based on calculating profit first and then working backwards to justify the method.\",\"Rule #1: It’s not what you put in your mouth that matters, it’s what makes it to your bloodstream. If it passes through, it doesn’t count.\",\"Rule #2: The hormonal responses to carbohydrates (CHO), protein and fat are different.\",\"Different sources of calories = different results.\",\"No consistent tracking = no awareness = no behavioural change. Consistent tracking, even if you have no knowledge of fat loss or exercise, will often beat advice from world-class trainers.\",\"“Harajuku Moment”? It’s an epiphany that turns a nice-to-have into a must-have. There is no point in getting started until it happens.\",\"“For a long time, I’ve known that the key to getting started down the path of being remarkable in anything is to simply act with the intention of being remarkable.\",\"“If I want a better-than-average career, I can’t simply ‘go with the flow’ and get it. Most people do just that: they wish for an outcome but make no intention-driven actions towards that outcome.\",\"“The number-one realization that led me to be able to keep doing it and make the right decisions was to use data.\",\"Oversimplifying is one of the next things I’ll mention as a tool. But\",\"“Building muscle is, as you know, one of the best ways to burn fat. But geeks don’t know how to build muscle.\",\"1. Make it conscious. 2. Make it a game. 3. Make it competitive. 4. Make it small and temporary.\",\"researchers concluded that photographs are more effective than written food diaries.\",\"Aristotle had it right, but he was missing a number: “We are what we do repeatedly”. A mere five times (five workouts, five meals, five of whatever we want) will be our goal. When in doubt, “take five” is the rule.\",\"Embrace peer pressure. It’s not just for kids.\",\"Avoid any carbohydrate that is, or can be, white. The following foods are prohibited, except for within 30 minutes of finishing a resistance-training workout like those described in the “From Geek to Freak” or “Occam’s Protocol” chapters: all bread, rice (including brown), cereal, potatoes, pasta, tortillas and fried food with breading. If you avoid eating the aforementioned foods and anything else white, you’ll be safe.\",\"Humans don’t need fruit six days a week, and they certainly don’t need it year-round.\",\"just say no to fruit and its principal sugar, fructose, which is converted to glycerol phosphate more efficiently than almost all other carbohydrates. Glycerol phosphate → triglycerides (via the liver) → fat storage.\",\"It’s the seventh day that allows you, if you so desire, to eat peach pancakes and banana bread until you go into a coma.\",\"That’s right: eating pure crap can help you lose fat. Welcome to Utopia.\",\"keeping a little notepad with me. Everytime I got a craving for something (sweet stuff or just regular food) I added it to the list of things I was going to feast on during my cheat day.\",\"There should be no need, or real physical urge, to eat snacks. If you are hungry, you’re not eating enough protein and legumes at each meal.\",\"Most men can. Some women can’t.\",\"eleven weeks, I adopted one new rule: my phone was no longer allowed to cuddle with my testicles.\",\"“Shoulders are prime movers in the jump and contribute up to 20% of your height.\",\"Static stretching is what most people think of as stretching—go into a stretch and hold it for 10 seconds or more. It turns out that this de facto approach can temporarily decrease the strength of the muscles and connective tissue being stretched, increasing the likelihood of injury.\"],\"synced\":1601311093922}],\"expires\":null}"
      }
    ],
    [
      "highlights:DON’T LOSE OUT, WORK OUT",
      {
        "value": "{\"value\":[{\"highlights\":[\"So if you are one of those carb avoiders, then you are gonna lose out on these benefits only to discover that the body is getting insulin insensitive which will tempt you to further reduce carbs which will further weaken the body’s glucose uptake and keep you fat.\",\"your body’s ability to extract oxygen from the blood and put it to use in your working muscle.\",\"Basically, jahan dil nahi lagta wahan waqt nahi guzarta.\"],\"synced\":1601311094660}],\"expires\":null}"
      }
    ],
    [
      "highlights:allTitles",
      {
        "value": "{\"value\":[\"The End of Jobs: Money, Meaning and Freedom Without the 9-to-5\",\"The Pragmatic Programmer: your journey to mastery, 20th Anniversary Edition\",\"How to Take Smart Notes: One Simple Technique to Boost Writing, Learning and Thinking – for Students, Academics and Nonfiction Book Writers\",\"The 4-Hour Body: An Uncommon Guide to Rapid Fat-loss, Incredible Sex and Becoming Superhuman\",\"DON’T LOSE OUT, WORK OUT\"],\"expires\":null}"
      }
    ]
  ],
  "lastExpire": 1601716617288
}
